app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs" LIMIT ?  [["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My great blog"], ["body", "This is blog."], ["created_at", "2022-10-04 23:57:35.986569"], ["updated_at", "2022-10-04 23:57:35.986569"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "New blog 5"], ["updated_at", "2022-10-05 00:20:28.981592"], ["id", 5]]